Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
#pragma once

#include <LiquidCrystal_PCF8574.h>
#include <Wire.h>

#include "ESP8266_Utils.h"
#include "ShutterManager.h"
#include "basic_defines.h"
#include "buttons.h"
#include "persistentVars.h"
#include "rtcTime.h"

LiquidCrystal_PCF8574 _lcd(LCD_I2C_ADDRESS);
static bool buttonIsReleased             = false;
static unsigned long buttonHoldingTimeMs = 0;

struct WifiConfig {
    String ssid;
    String password;
    bool enabled;
    bool ota_enabled;
};

struct VolumeConfig {
    uint32_t previousVolume;
    bool previousBuzzerEnabled;
};

struct TimezoneConfig {
    time_t time;
    unsigned long whichIncrementIndex;
    long timezoneShift;
};

struct PendingConfig {
    struct WifiConfig wifi;
    struct VolumeConfig volume;
    struct TimezoneConfig timezone;
};

static PendingConfig pendingConfig;

#define LCD_SPECIAL_CHAR_BASE                                         (char)(10)
#define LCD_SPECIAL_CHAR_LEFT_ARROW            (char)(LCD_SPECIAL_CHAR_BASE + 0)
#define LCD_SPECIAL_CHAR_UP_ARROW              (char)(LCD_SPECIAL_CHAR_BASE + 1)
#define LCD_SPECIAL_CHAR_DOWN_ARROW            (char)(LCD_SPECIAL_CHAR_BASE + 2)
#define LCD_SPECIAL_CHAR_RIGHT_ARROW           (char)(LCD_SPECIAL_CHAR_BASE + 3)
#define LCD_SPECIAL_CHAR_STOP_ARROW            (char)(LCD_SPECIAL_CHAR_BASE + 4)
#define LCD_SPECIAL_CHAR_CONNECTED_SYMBOL      (char)(LCD_SPECIAL_CHAR_BASE + 5)
#define LCD_SPECIAL_CHAR_WARNING_SYMBOL        (char)(LCD_SPECIAL_CHAR_BASE + 6)
// Keep this in sync with the number of custom characters defined above.
// Maximum is 8, but we use only 7.
#define LCD_SPECIAL_CHAR_TOTAL_CHARS                                         (7)

#define LCD_SLIDE_OR_FLASH_SPEED_MS                                        (500)
#define LCD_HOLDING_TIME_CONFIRM_MS                                       (2000)

#define LCD_CLOCK_UPDATE_INTERVAL_MS                                     (60000)

void pantalla_apagarBrillo(void) { _lcd.setBacklight(0); }

void pantalla_encenderBrillo(void) { _lcd.setBacklight(255); }

void _sendLcdBuffer(String line1, String line2) {
    _lcd.home();
    _lcd.clear();
    for (int i = 0; i < 16; i++) {
        _lcd.setCursor(i, 0);
        if ((line1[i] >= LCD_SPECIAL_CHAR_BASE)
            && (line1[i] < LCD_SPECIAL_CHAR_BASE + LCD_SPECIAL_CHAR_TOTAL_CHARS)) {
            _lcd.write(line1[i] - LCD_SPECIAL_CHAR_BASE);
        } else {
            _lcd.print(line1[i]);
        }
        _lcd.setCursor(i, 1);
        if ((line2[i] >= LCD_SPECIAL_CHAR_BASE)
            && (line2[i] < LCD_SPECIAL_CHAR_BASE + LCD_SPECIAL_CHAR_TOTAL_CHARS)) {
            _lcd.write(line2[i] - LCD_SPECIAL_CHAR_BASE);
        } else {
            _lcd.print(line2[i]);
        }
    }
}

String _getScrollingText(String text, unsigned int visibleChars) {
    static unsigned long lastScrollTime = 0;
    static unsigned int scrollOffset    = 0;

    // Añadir separación al final para el efecto loop
    String scrollingSSID = text + String("   "); // espacio entre loops

    // Actualizar desplazamiento cada 200ms
    if (millis() - lastScrollTime >= LCD_SLIDE_OR_FLASH_SPEED_MS) {
        lastScrollTime = millis();
        scrollOffset++;
        if (scrollOffset >= scrollingSSID.length()) {
            scrollOffset = 0;
        }
    }

    // Construir ventana deslizante
    String scrolled;
    for (unsigned int i = 0; i < visibleChars; ++i) {
        int charIndex  = (scrollOffset + i) % scrollingSSID.length();
        scrolled      += scrollingSSID.charAt(charIndex);
    }

    while (scrolled.length() < visibleChars) {
        scrolled += " ";
    }

    return scrolled;
}

bool pantalla_sendLcdBuffer(String newBuffer) {
    static String bufferAnterior;
    if ((bufferAnterior != newBuffer) && (newBuffer != "")) {
        bufferAnterior = newBuffer;
        String line1   = newBuffer.substring(0, 16);
        String line2   = newBuffer.substring(16, 32);
        _sendLcdBuffer(line1, line2);
        return true;
    }
    return false;
}

bool pantalla_iniciar(int32_t timeout_ms) {
    // Search LCD into I2C line:
    while (timeout_ms > 0) {
        Wire.begin(2, 14);
        Wire.beginTransmission(LCD_I2C_ADDRESS);
        if (Wire.endTransmission() != 0) {
            // wait 2 seconds for reconnection:
            delay(2000);
            timeout_ms -= 2000;
        } else {
            // LCD found, we can continue
            break;
        }
    }

    if (timeout_ms <= 0) {
        return false;
    }

    _lcd.begin(16, 2);
    uint8_t customArrayChar[LCD_SPECIAL_CHAR_TOTAL_CHARS][8] = {
        // LCD_SPECIAL_CHAR_LEFT_ARROW
        { 0x00, 0x07, 0x0E, 0x1C, 0x1C, 0x0E, 0x07, 0x00 },
        // LCD_SPECIAL_CHAR_UP_ARROW
        { 0x00, 0x04, 0x0E, 0x1F, 0x1B, 0x11, 0x00, 0x00 },
        // LCD_SPECIAL_CHAR_DOWN_ARROW
        { 0x00, 0x00, 0x11, 0x1B, 0x1F, 0x0E, 0x04, 0x00 },
        // LCD_SPECIAL_CHAR_RIGHT_ARROW
        { 0x00, 0x1C, 0x0E, 0x07, 0x07, 0x0E, 0x1C, 0x00 },
        // LCD_SPECIAL_CHAR_STOP_ARROW
        { 0x00, 0x0E, 0x1B, 0x11, 0x11, 0x1B, 0x0E, 0x00 },
        // LCD_SPECIAL_CHAR_CONNECTED_SYMBOL
        { 0x04, 0x0E, 0x1B, 0x1B, 0x0E, 0x04, 0x04, 0x00 },
        // LCD_SPECIAL_CHAR_WARNING_SYMBOL
        { 0x0E, 0x11, 0x15, 0x15, 0x11, 0x15, 0x11, 0x0E }
    };
    for (int i = 0; i < LCD_SPECIAL_CHAR_TOTAL_CHARS; i++) {
        _lcd.createChar(i, customArrayChar[i]);
    }
    return true;
}

void pantalla_handleButtonInMenu(
        uint8_t* currentMenu,
        uint8_t currentButtonPressed,
        uint8_t currentButtonHolding) {
    uint8_t newMenu = *currentMenu;
    switch (newMenu) {
        case SELECCION_MENU_RELOJ:
            break;
        case SELECCION_MENU_PERSIANA_IZQUIERDA:
            // fall through
        case SELECCION_MENU_PERSIANA_CENTRAL:
            // fall through
        case SELECCION_MENU_PERSIANA_DERECHA: {
            uint8_t _localShutterIndex     = (SELECCION_MENU_PERSIANA_TO_INDEX(newMenu));
            ShutterStatus_t _shutterStatus = shutterGetStatus(_localShutterIndex);
            switch (currentButtonPressed) {
                case BUTTON_STATUS_LEFT:
                    newMenu--;
                    // Sanitize menu transition to left
                    if (newMenu < SELECCION_MENU_PERSIANA_IZQUIERDA) {
                        newMenu = SELECCION_MENU_CONFIG;
                    }
                    break;
                case BUTTON_STATUS_RIGHT:
                    newMenu++;
                    // Sanitize menu transition to right
                    if (newMenu > SELECCION_MENU_PERSIANA_DERECHA) {
                        newMenu = SELECCION_MENU_CONFIG;
                    }
                    break;
                case BUTTON_STATUS_UP:
                    if ((_shutterStatus == SHUTTER_STATUS_MOVING_UP)
                        || _shutterStatus == SHUTTER_STATUS_MOVING_DOWN) {
                        shutterPararPersiana(_localShutterIndex);
                    } else {
                        shutterSubirPersiana(_localShutterIndex);
                    }
                    break;
                case BUTTON_STATUS_DOWN:
                    if ((_shutterStatus == SHUTTER_STATUS_MOVING_DOWN)
                        || _shutterStatus == SHUTTER_STATUS_MOVING_UP) {
                        shutterPararPersiana(_localShutterIndex);
                    } else {
                        shutterBajarPersiana(_localShutterIndex);
                    }
                    break;
            }
            break;
        }
        case SELECCION_MENU_CONFIG: {
            switch (currentButtonPressed) {
                case BUTTON_STATUS_LEFT:
                    newMenu = SELECCION_MENU_PERSIANA_DERECHA;
                    break;
                case BUTTON_STATUS_RIGHT:
                    newMenu = SELECCION_MENU_PERSIANA_IZQUIERDA;
                    break;
                case BUTTON_STATUS_DOWN:
                    newMenu = SELECCION_MENU_CONFIG_FECHA_HORA;
                    break;
                case BUTTON_STATUS_UP:
                    buzzer_sound_error();
                    break;
            }
            break;
        }
        case SELECCION_MENU_CONFIG_FECHA_HORA: {
            switch (currentButtonPressed) {
                case BUTTON_STATUS_UP:
                    newMenu = SELECCION_MENU_CONFIG;
                    break;
                case BUTTON_STATUS_RIGHT:
                    pendingConfig.timezone.time                = time(NULL);
                    pendingConfig.timezone.whichIncrementIndex = 0;
                    newMenu = SELECCION_MENU_CONFIG_FECHA_HORA_AJUSTE;
                    break;
                case BUTTON_STATUS_DOWN:
                    newMenu = SELECCION_MENU_CONFIG_VOLUMEN;
                    break;
                case BUTTON_STATUS_LEFT:
                    buzzer_sound_error();
                    break;
            }
            break;
        }
        case SELECCION_MENU_CONFIG_FECHA_HORA_AJUSTE: {
            static const unsigned long incs[5] = {
                3600UL,    // hours
                60UL,      // minutes
                86400UL,   // days
                2592000UL, // months (~30d)
                31536000UL // years (~365d)
            };
            static const unsigned long incsCount = sizeof(incs) / sizeof(incs[0]);

