Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
            ESP8266Utils_getSsidAtIndex(currentIndex, pendingConfig.wifi.ssid);

            switch (currentButtonPressed) {
                case BUTTON_STATUS_UP:
                    if (currentIndex > 0) {
                        currentIndex--;
                    }
                    ESP8266Utils_getSsidAtIndex(currentIndex, pendingConfig.wifi.ssid);
                    break;
                case BUTTON_STATUS_RIGHT:
                    pendingConfig.wifi.password = "";
                    newMenu                     = SELECCION_MENU_CONFIG_WIFI_PASSWORD;
                    break;
                case BUTTON_STATUS_DOWN:
                    if (currentIndex < (countNetworks - 1)) {
                        currentIndex++;
                    }
                    ESP8266Utils_getSsidAtIndex(currentIndex, pendingConfig.wifi.ssid);
                    break;
                case BUTTON_STATUS_LEFT:
                    newMenu = SELECCION_MENU_CONFIG_WIFI_OTA_HABILITAR;
                    break;
            }
            break;
        }
        case SELECCION_MENU_CONFIG_WIFI_PASSWORD: {
            static uint8_t previousButtonHolding = BUTTON_STATUS_NONE;

            unsigned long now = millis();

            if ((previousButtonHolding != currentButtonHolding)
                && (currentButtonHolding != BUTTON_STATUS_NONE)) {
                buttonHoldingTimeMs   = now;
                previousButtonHolding = currentButtonHolding;
            } else if (
                    (previousButtonHolding != currentButtonHolding)
                    && (currentButtonHolding == BUTTON_STATUS_NONE)) {
                if ((now - buttonHoldingTimeMs) >= LCD_HOLDING_TIME_CONFIRM_MS) {
                    if (previousButtonHolding == BUTTON_STATUS_DOWN) {
                        buzzer_sound_accept();
                        ESP8266Utils_connectToWifi(
                                pendingConfig.wifi.ssid,
                                pendingConfig.wifi.password);
                        newMenu = SELECCION_MENU_CONFIG_WIFI_RESULTADO;
                    }
                } else {
                    switch (previousButtonHolding) {
                        case BUTTON_STATUS_LEFT:
                            if (pendingConfig.wifi.password.length() == 0) {
                                newMenu = SELECCION_MENU_CONFIG_WIFI_SSID;
                            } else {
                                pendingConfig.wifi.password.remove(
                                        pendingConfig.wifi.password.length() - 1);
                            }
                            break;
                        case BUTTON_STATUS_UP:
                            if (pendingConfig.wifi
                                        .password[pendingConfig.wifi.password.length() - 1]
                                < '~') {
                                pendingConfig.wifi
                                        .password[pendingConfig.wifi.password.length() - 1]++;
                            }
                            break;
                        case BUTTON_STATUS_DOWN:
                            if (pendingConfig.wifi
                                        .password[pendingConfig.wifi.password.length() - 1]
                                > '!') {
                                pendingConfig.wifi
                                        .password[pendingConfig.wifi.password.length() - 1]--;
                            }
                            break;
                        case BUTTON_STATUS_RIGHT:
                            pendingConfig.wifi.password += 'A';
                            break;
                    }
                }
                previousButtonHolding = currentButtonHolding;
            }
            break;
        }
        case SELECCION_MENU_CONFIG_WIFI_RESULTADO: {
            switch (currentButtonPressed) {
                case BUTTON_STATUS_RIGHT:
                    if (ESP8266Utils_isWifiConnected()) {
                        buzzer_sound_accept();
                        memcpy(settings.wifiSettings.ssid_sta,
                               pendingConfig.wifi.ssid.c_str(),
                               sizeof(settings.wifiSettings.ssid_sta));
                        memcpy(settings.wifiSettings.password_sta,
                               pendingConfig.wifi.password.c_str(),
                               sizeof(settings.wifiSettings.password_sta));
                        EEPROM_Schedule_Write(0);
                        newMenu = SELECCION_MENU_CONFIG_WIFI;
                    } else {
                        buzzer_sound_error();
                    }
                    break;
                case BUTTON_STATUS_LEFT:
                    newMenu = SELECCION_MENU_CONFIG_WIFI_PASSWORD;
                    break;
                case BUTTON_STATUS_DOWN:
                case BUTTON_STATUS_UP:
                    buzzer_sound_error();
                    break;
            }
            break;
        }
    }
    *currentMenu = newMenu;
}

void pantalla_actualizarReloj(String* lcdBuffer) {
    if (ESP8266Utils_isWifiConnected()) {
        *lcdBuffer = LCD_SPECIAL_CHAR_CONNECTED_SYMBOL;
    } else {
        *lcdBuffer = " ";
    }
    *lcdBuffer += "  ";
    time_t now;
    struct tm* timeinfo;
    now      = time(&now) + persistentVars_get_rtcTime().timezoneShift;
    timeinfo = localtime(&now);

    if ((timeinfo->tm_hour) < 10) {
        *lcdBuffer += String('0');
    }
    *lcdBuffer += String(timeinfo->tm_hour);
    *lcdBuffer += String(':');

    if ((timeinfo->tm_min) < 10) {
        *lcdBuffer += String('0');
    }
    *lcdBuffer += String(timeinfo->tm_min);
    *lcdBuffer += String("   ");

    if ((ESP8266Utils_get_errors() & WIFI_ERROR_WEATHER_UPDATE_FAILED_MASK)) {
        *lcdBuffer += "    ";
        *lcdBuffer += LCD_SPECIAL_CHAR_WARNING_SYMBOL;
    } else {
        double temp;
        if (ESP8266Utils_get_TemperatureDegree(&temp)) {
            int t = (int)temp;

            if (t < 0) {
                *lcdBuffer += " <0";
            } else if (t > 50) {
                *lcdBuffer += ">50";
            } else {
                *lcdBuffer += " ";
                if (t < 10) {
                    *lcdBuffer += " "; // leading space for single digit
                }
                *lcdBuffer += String(t);
            }

            *lcdBuffer += (char)223; // degree symbol
            *lcdBuffer += "C";
        } else {
            *lcdBuffer += "     "; // blank when no data
        }
    }

