Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
    if ((timeinfo->tm_mday) < 10) {
        *lcdBuffer += String('0');
    }
    *lcdBuffer += String(timeinfo->tm_mday);
    *lcdBuffer += String("/");

    if ((timeinfo->tm_mon + 1) < 10) {
        *lcdBuffer += String('0');
    }
    *lcdBuffer += String(timeinfo->tm_mon + 1);
    *lcdBuffer += String("/");

    *lcdBuffer += String((timeinfo->tm_year) + 1900);
    *lcdBuffer += String("  ");

    int dayofweek = (timeinfo->tm_wday);
    switch (dayofweek) {
        case 0:
            *lcdBuffer += String("Dom.");
            break;
        case 1:
            *lcdBuffer += String("Lun.");
            break;
        case 2:
            *lcdBuffer += String("Mar.");
            break;
        case 3:
            *lcdBuffer += String("Mie.");
            break;
        case 4:
            *lcdBuffer += String("Jue.");
            break;
        case 5:
            *lcdBuffer += String("Vie.");
            break;
        case 6:
            *lcdBuffer += String("Sab.");
            break;
        default:
            *lcdBuffer += String("Err.");
            break;
    }
}

void pantalla_actualizarMenuShutter(String* lcdBuffer, uint8_t currentShutterIndex) {
    String namePersiana[] = { " PERSIANA IZQDA ", "PERSIANA CENTRAL", "PERSIANA DERECHA" };

    *lcdBuffer += namePersiana[currentShutterIndex];
    *lcdBuffer += String("<    ");

    if (shutterGetStatus(currentShutterIndex) == SHUTTER_STATUS_MOVING_UP) {
        *lcdBuffer += LCD_SPECIAL_CHAR_STOP_ARROW;
    } else {
        *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    }

    *lcdBuffer += String("    ");

    if (shutterGetStatus(currentShutterIndex) == SHUTTER_STATUS_MOVING_DOWN) {
        *lcdBuffer += LCD_SPECIAL_CHAR_STOP_ARROW;
    } else {
        *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    }

    *lcdBuffer += String("    >");
}

void pantalla_actualizarMenuConfig(String* lcdBuffer) {
    *lcdBuffer += String(" MENU DE CONFIG ");
    *lcdBuffer += String("<      ");
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigFechaHora(String* lcdBuffer) {
    *lcdBuffer += String("  CONFIG. HORA  ");
    *lcdBuffer += String("       ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigFechaHoraAjuste(String* lcdBuffer) {
    struct tm* timeinfo = localtime(&pendingConfig.timezone.time);

    static unsigned long lastFlashMs = 0;
    static bool flashOn              = false;

    if ((millis() - lastFlashMs) > LCD_SLIDE_OR_FLASH_SPEED_MS) {
        lastFlashMs = millis();
        flashOn     = !flashOn;
    }

    auto printField = [&](int value, unsigned long index, int width) {
        bool visible = (pendingConfig.timezone.whichIncrementIndex != index) || flashOn;
        if (visible) {
            if (value < 10 && width >= 2) {
                *lcdBuffer += '0';
            }
            *lcdBuffer += String(value);
        } else {
            for (int i = 0; i < width; ++i) {
                *lcdBuffer += ' ';
            }
        }
    };

    // Format: hh:mm dd/mm/yyyy
    printField(timeinfo->tm_hour, 0, 2);
    *lcdBuffer += ':';
    printField(timeinfo->tm_min, 1, 2);
    *lcdBuffer += ' ';
    printField(timeinfo->tm_mday, 2, 2);
    *lcdBuffer += '/';
    printField(timeinfo->tm_mon + 1, 3, 2);
    *lcdBuffer += '/';
    printField(timeinfo->tm_year + 1900, 4, 4);

    *lcdBuffer += "<      ";
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += "      >";
}

void pantalla_actualizarMenuConfigZonaHorariaAjuste(String* lcdBuffer) {
    *lcdBuffer += String("ZONA UTC: ");
    *lcdBuffer += String(pendingConfig.timezone.timezoneShift / 3600);
    *lcdBuffer += String(" h");
    // Add spaces to fill the line.
    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }
    *lcdBuffer += String("<      ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("    OK>");
}

void pantalla_actualizarMenuConfigVolumen(String* lcdBuffer) {
    *lcdBuffer += String("CONFIG.  VOLUMEN");
    *lcdBuffer += String("       ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigVolumenAjuste(String* lcdBuffer) {
    *lcdBuffer += String("VOLUMEN:  ");
    // If disabled, show a message
    if (!buzzer_is_enabled()) {
        *lcdBuffer += String(" NO");
    } else {
        uint32_t volumePercentage = (buzzer_get_volume() - buzzer_get_volume_min()) * 100
                                  / (buzzer_get_volume_max() - buzzer_get_volume_min());
        *lcdBuffer += String(volumePercentage);
        *lcdBuffer += String(" %");
    }
    // Add spaces to fill the line.
    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }
    *lcdBuffer += String("<      ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("    OK>");
}

void pantalla_actualizarMenuConfigDebug(String* lcdBuffer) {
    *lcdBuffer += String("   DEPURACION   ");
    *lcdBuffer += String("       ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigDebugSoftRstCount(String* lcdBuffer) {
    *lcdBuffer += String("REINICIOS: ");

    // If the count is greater than 9999, show "9999+".
    uint32_t softResetCount = persistentVars_get_softResetCount();
    if (softResetCount > 9999) {
        *lcdBuffer += String("9999+");
    } else {
        *lcdBuffer += String(softResetCount);
    }
    // Add spaces to fill the line.
    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }
    *lcdBuffer += String("<              >");
}

void pantalla_actualizarMenuConfigDebugWifiSsid(String* lcdBuffer) {
    *lcdBuffer  = String("WIFI: ");
    *lcdBuffer += _getScrollingText(settings.wifiSettings.ssid_sta, 10);

    if (ESP8266Utils_isWifiConnected()) {
        *lcdBuffer += String("<  CONECTADO   >");
    } else {
        *lcdBuffer += String("< DESCONECTADO >");
    }
}

