Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
void pantalla_actualizarMenuConfigDebugWifiIp(String* lcdBuffer) {
    *lcdBuffer += String("IP: ");
    *lcdBuffer += _getScrollingText(ESP8266Utils_getWifiIP(), 12);
    *lcdBuffer += String("<               ");
}

void pantalla_actualizarMenuConfigWifi(String* lcdBuffer) {
    *lcdBuffer += String(" CONFIG DE WIFI ");
    *lcdBuffer += String("       ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigWifiHabilitar(String* lcdBuffer) {
    if (pendingConfig.wifi.enabled) {
        *lcdBuffer += String("   WIFI : SI    ");
    } else {
        *lcdBuffer += String("   WIFI : NO    ");
    }
    *lcdBuffer += String("<      ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigWifiOTAHabilitar(String* lcdBuffer) {
    if (pendingConfig.wifi.ota_enabled) {
        *lcdBuffer += String("  WIFI OTA: SI  ");
    } else {
        *lcdBuffer += String("  WIFI OTA: NO  ");
    }
    *lcdBuffer += String("<      ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigWifiPassword(String* lcdBuffer) {
    *lcdBuffer += String("PWD: ");

    // If password is larger than 11 characters, truncate it from the
    // left to right, keeping the last 11 characters.
    String truncatedPassword = pendingConfig.wifi.password;
    if (truncatedPassword.length() > 11) {
        truncatedPassword = truncatedPassword.substring(truncatedPassword.length() - 11);
    }
    *lcdBuffer += truncatedPassword;

    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }

    const String texts[] = {
        "<      ^^      >", // 0% holding time
        "<     -^^-     >", // 16% holding time
        "<    --^^--    >", // 33% holding time
        "<   ---^^---   >", // 50% holding time
        "<  ----^^----  >", // 66% holding time
        "< -----^^----- >", // 83% holding time
        "<------^^------>"  // 100% holding time
    };
    const unsigned long textsCount = sizeof(texts) / sizeof(texts[0]);

    unsigned long textIndex         = 0;
    const unsigned long holdingTime = millis() - buttonHoldingTimeMs;
    if (buttonHolding() == BUTTON_STATUS_DOWN) {
        textIndex = (holdingTime * textsCount) / LCD_HOLDING_TIME_CONFIRM_MS;
        if (textIndex > textsCount - 1) {
            textIndex = textsCount - 1; // Limit to the last text
        }
    } else {
        textIndex = 0;
    }

    static unsigned long lastFlashMs = 0;
    static bool flashOn              = false;

    if ((millis() - lastFlashMs) > (LCD_SLIDE_OR_FLASH_SPEED_MS / 4)) {
        lastFlashMs = millis();
        flashOn     = !flashOn;
    }

    for (unsigned long i = 0; i < 16; i++) {
        if ((i != 7) && (i != 8)) {
            *lcdBuffer += texts[textIndex][i];
        } else {
            if (textIndex != textsCount - 1) {
                if (i == 7) {
                    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
                } else {
                    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
                }
            } else if (flashOn) {
                *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            } else {
                *lcdBuffer += ' ';
            }
        }
    }
}

void pantalla_actualizarMenuConfigWifiSsid(String* lcdBuffer) {
    *lcdBuffer += String("SSID:");

    String mySSID         = pendingConfig.wifi.ssid;
    int adjustedSSIDindex = ESP8266Utils_getIndexBySsid(pendingConfig.wifi.ssid);
    if (adjustedSSIDindex < 0) {
        mySSID = "No hay redes";
    }
    *lcdBuffer += _getScrollingText(mySSID, 11);

    // Agregar navegación
    *lcdBuffer += String("<     ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    adjustedSSIDindex++;
    if (adjustedSSIDindex == 0) {
        *lcdBuffer += String("  ");
    } else if (adjustedSSIDindex < 10) {
        *lcdBuffer += String("0");
        *lcdBuffer += String(adjustedSSIDindex);
    } else {
        *lcdBuffer += String(adjustedSSIDindex);
    }
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("     >");
}

void pantalla_actualizarMenuConfigWifiResultado(String* lcdBuffer) {
    int porcentaje = ESP8266Utils_getWifiConnectionPercentage();
    if (porcentaje > 100) {
        porcentaje = 100; // Limit to 100%
    }
    if (ESP8266Utils_isWifiConnected()) {
        *lcdBuffer += String("WIFI: CONECTADO ");
        *lcdBuffer += String("<            OK>");
    } else {
        if (porcentaje == 100) {
            *lcdBuffer += String("WIFI:  FALLIDO  ");
        } else {
            *lcdBuffer += String("WIFI:  ESPERE   ");
        }
        *lcdBuffer += String("< [");
        for (int i = 0; i < 10; i++) {
            if (i < (porcentaje / 10)) {
                *lcdBuffer += String("=");
            } else {
                *lcdBuffer += String(" ");
            }
        }
        *lcdBuffer += String("]  ");
    }
}

void pantalla_actualizarMenu(uint8_t selectedMenu) {
    String lcdBuffer = "";
    switch (selectedMenu) {
        case SELECCION_MENU_RELOJ:
            pantalla_actualizarReloj(&lcdBuffer);
            break;
        case SELECCION_MENU_PERSIANA_IZQUIERDA:
            // fall through
        case SELECCION_MENU_PERSIANA_CENTRAL:
            // fall through
        case SELECCION_MENU_PERSIANA_DERECHA: {
            uint8_t currentShutterIndex = (SELECCION_MENU_PERSIANA_TO_INDEX(selectedMenu));
            pantalla_actualizarMenuShutter(&lcdBuffer, currentShutterIndex);
            break;
        }
        case SELECCION_MENU_CONFIG:
            pantalla_actualizarMenuConfig(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_FECHA_HORA:
            pantalla_actualizarMenuConfigFechaHora(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_FECHA_HORA_AJUSTE:
            pantalla_actualizarMenuConfigFechaHoraAjuste(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_ZONA_HORARIA_AJUSTE:
            pantalla_actualizarMenuConfigZonaHorariaAjuste(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_VOLUMEN:
            pantalla_actualizarMenuConfigVolumen(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_VOLUMEN_AJUSTE:
            pantalla_actualizarMenuConfigVolumenAjuste(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_DEBUG:
            pantalla_actualizarMenuConfigDebug(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_DEBUG_SOFT_RST_COUNT:
            pantalla_actualizarMenuConfigDebugSoftRstCount(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_DEBUG_WIFI_SSID:
            pantalla_actualizarMenuConfigDebugWifiSsid(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_DEBUG_WIFI_IP:
            pantalla_actualizarMenuConfigDebugWifiIp(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI:
            pantalla_actualizarMenuConfigWifi(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI_HABILITAR:
            pantalla_actualizarMenuConfigWifiHabilitar(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI_OTA_HABILITAR:
            pantalla_actualizarMenuConfigWifiOTAHabilitar(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI_SSID:
            pantalla_actualizarMenuConfigWifiSsid(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI_PASSWORD:
            pantalla_actualizarMenuConfigWifiPassword(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI_RESULTADO:
            pantalla_actualizarMenuConfigWifiResultado(&lcdBuffer);
            break;
    }
    pantalla_sendLcdBuffer(lcdBuffer);
}

void pantalla_actualizar(bool showClock, uint8_t wantedMenu) {
    bool isNtpReady = rtc_on_sync();

    // 1) explicit clock request: always show if NTP is ready
    if ((wantedMenu == SELECCION_MENU_RELOJ) && isNtpReady) {
        pantalla_actualizarMenu(SELECCION_MENU_RELOJ);
        return;
    }

    // 2) periodic clock refresh if allowed and NTP is ready
    if (showClock && isNtpReady) {
        static unsigned long lastClockUpdate = 0;
        unsigned long now                    = millis();
        if ((now - lastClockUpdate) >= LCD_CLOCK_UPDATE_INTERVAL_MS) {
            lastClockUpdate = now;
            pantalla_actualizarMenu(SELECCION_MENU_RELOJ);
        }
        return;
    }

    // 3) normal menus (valid and not clock)
    if (wantedMenu < SELECCION_MENU_MAX && (wantedMenu != SELECCION_MENU_RELOJ)) {
        pantalla_actualizarMenu(wantedMenu);
    }
}

